publish-html/simple-publish.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2017-11-19 Sun 17:22 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>&lrm;</title>
<meta name="generator" content="Org mode">
<meta name="author" content="ai">
</head>
<body>
<div id="content">
<div id="outline-container-orga62246e" class="outline-3">
<h3 id="orga62246e">First Thoughts on Configuring Spacemacs org-mode as a web site generator</h3>
<div class="outline-text-3" id="text-orga62246e">
<p>
The default html export adds a lot of cruft to the output html files.
</p>
</div>
</div>
<div id="outline-container-org6b50ba4" class="outline-3">
<h3 id="org6b50ba4">How to run this as a build script</h3>
<div class="outline-text-3" id="text-org6b50ba4">
<p>
How about tangling it out as an elisp script and then run it from the command line with emacs?
</p>
</div>
</div>


<div id="outline-container-orgdc64091" class="outline-2">
<h2 id="orgdc64091">Raw code to tangle out</h2>
<div class="outline-text-2" id="text-orgdc64091">
</div>
<div id="outline-container-org82c3d9f" class="outline-3">
<h3 id="org82c3d9f">First let's set up the css and javascript imports</h3>
<div class="outline-text-3" id="text-org82c3d9f">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">setq</span> cssjs <span style="color: #2d9574;">"&lt;link rel='stylesheet' type='text/css' href='../css/css/htmlize.css'&gt;</span>

<span style="color: #2d9574;">             &lt;script type='text/javascript' src='../../jsLibraries/jquery.min.js'&gt;&lt;/script&gt;</span>
<span style="color: #2d9574;">             &lt;script type='text/javascript' src='../../jsLibraries/bootstrap.bundle.min.js'&gt;&lt;/script&gt;</span>
<span style="color: #2d9574;">             &lt;script type='text/javascript' src='../css/js/readtheorg.js'&gt;&lt;/script&gt;"</span><span style="color: #3a81c3;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">setq</span> cssjs <span style="color: #2d9574;">"&lt;link&gt;"</span><span style="color: #3a81c3;">)</span> 
</pre>
</div>
</div>
</div>

<div id="outline-container-org773047e" class="outline-3">
<h3 id="org773047e">Reset a lot of the default html output</h3>
<div class="outline-text-3" id="text-org773047e">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">setq</span> org-html-head-include-scripts nil 
      org-html-html5-fancy t 
      org-html-doctype <span style="color: #2d9574;">"html5"</span>
      org-html-head-include-default-style nil<span style="color: #3a81c3;">)</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-orgc35c3c9" class="outline-3">
<h3 id="orgc35c3c9">Initialize the publishing properties</h3>
<div class="outline-text-3" id="text-orgc35c3c9">
<div class="org-src-container">
<pre class="src src-emacs-lisp">     <span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">setq</span> org-publish-project-alist
           '<span style="color: #6c3163;">(</span><span style="color: #2d9574;">(</span><span style="color: #2d9574;">"simple-publish"</span>
              <span style="color: #3a81c3;">:base-directory</span> <span style="color: #2d9574;">"."</span>
              <span style="color: #3a81c3;">:base-extension</span> <span style="color: #2d9574;">"org"</span>
              <span style="color: #3a81c3;">:publishing-directory</span> <span style="color: #2d9574;">"../publish-html"</span>
              <span style="color: #3a81c3;">:publishing-function</span> org-html-publish-to-html
              <span style="color: #3a81c3;">:section-numbers</span> nil
              <span style="color: #3a81c3;">:with-toc</span> nil
              <span style="color: #2aa1ae; background-color: #ecf3ec;">;;</span><span style="color: #2aa1ae; background-color: #ecf3ec;">:html-head ,cssjs</span>
              <span style="color: #3a81c3;">:html-extension</span> <span style="color: #2d9574;">"html"</span>
              <span style="color: #2aa1ae; background-color: #ecf3ec;">;;</span><span style="color: #2aa1ae; background-color: #ecf3ec;">:html-postamble "&lt;div id="postamble" class="status"&gt;"</span>
<span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3;">(</span>org-publish-current-project<span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: ai</p>
<p class="date">Created: 2017-11-19 Sun 17:22</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
